hw2/README.org
#+OPTIONS: toc:nil
* Setup
*** Compiler version (=g++ -v=)
#+BEGIN_SRC
Using built-in specs.
COLLECT_GCC=/usr/bin/g++
COLLECT_LTO_WRAPPER=/usr/lib/gcc/x86_64-pc-linux-gnu/9.2.1/lto-wrapper
Target: x86_64-pc-linux-gnu
Configured with: /build/gcc/src/gcc/configure --prefix=/usr --libdir=/usr/lib ...
Thread model: posix
gcc version 9.2.1 20200130 (Arch Linux 9.2.1+20200130-2)
#+END_SRC

*** Processor
| Model         | Intel(R) Core(TM) i7-8550U CPU @ 1.80GHz |
| Max Flop rate | 25.96 GFLOPs                             |
| Max bandwidth | 35.76 GiB/s                              |


* Q2. Matrix-matrix multiplication

** Questions
The optimal value of =BLOCK_SIZE= is 16.
The code achieves a maximum of 80% of peak flop rate for the smaller sized matrices.

** Timings

| Dimension | Time - Blocked version | Time - OpenMP version |
|-----------+------------------------+-----------------------|
|      1024 |               0.392636 |              0.254664 |
|      1072 |               0.241596 |              0.238849 |
|      1120 |               0.297218 |              0.253248 |
|      1168 |               0.327683 |              0.286684 |
|      1216 |               0.437334 |              0.280523 |
|      1264 |               0.407966 |              0.400364 |
|      1312 |               0.509102 |              0.836481 |
|      1360 |               0.507661 |              0.437908 |
|      1408 |               0.892849 |              0.442123 |
|      1456 |               0.636359 |              0.475716 |
|      1504 |               1.014875 |              0.670422 |
|      1552 |               0.793876 |              0.619685 |
|      1600 |               1.336579 |              0.713375 |
|      1648 |               0.930474 |              0.898537 |
|      1696 |               1.551997 |              0.768537 |
|      1744 |               1.202396 |              0.813551 |
|      1792 |               2.446570 |              1.033018 |
|      1840 |               1.312623 |              0.961884 |
|      1888 |               1.960448 |              1.084041 |
|      1936 |               1.717503 |              1.188402 |
|      1984 |               2.431242 |              1.313678 |

* Q4. Jacobi/Gauss-Seidel smoothing
** Timings
| Dimension | Threads | Time - Jacobi | Time - Gauss-Seidel |
|-----------+---------+---------------+---------------------|
|      1000 |       1 |      0.016777 |           0.0420625 |
|      1000 |       2 |       0.01272 |           0.0300278 |
|      1000 |       4 |     0.0113041 |           0.0254845 |
|      1000 |       8 |     0.0912515 |            0.131496 |
|      1000 |      16 |     0.0162705 |           0.0315926 |
|      2000 |       1 |     0.0759777 |            0.147523 |
|      2000 |       2 |      0.061264 |            0.117789 |
|      2000 |       4 |     0.0584821 |            0.126328 |
|      2000 |       8 |      0.130799 |            0.154627 |
|      2000 |      16 |     0.0544273 |             0.12954 |
|      5000 |       1 |      0.450877 |            0.982183 |
|      5000 |       2 |      0.356313 |            0.789708 |
|      5000 |       4 |      0.309172 |            0.986109 |
|      5000 |       8 |      0.321736 |             1.12963 |
|      5000 |      16 |      0.304599 |            0.758378 |
|     10000 |       1 |       1.68608 |             3.50216 |
|     10000 |       2 |       1.34041 |             3.01577 |
|     10000 |       4 |       1.21576 |             3.10543 |
|     10000 |       8 |       1.18356 |             3.26753 |
|     10000 |      16 |       1.18217 |             3.02093 |
